app/controllers/posts_controller.rb

  def update
    @post = Post.find(params[:id])
    @post.update(title: params[:post][:title], description: params[:post][:description])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "posts" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", nil], ["description", nil], ["updated_at", "2018-10-22 15:48:46.433934"], ["id", 1]]